In [1]:
import numpy as np

In [2]:
np

In [3]:
var = np.arange(20).reshape(5, 4)

In [4]:
var

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [5]:
##when importing csv, data stored in numpy array

In [6]:
var.sum()

190

In [7]:
var.sum(axis = 0)

array([40, 45, 50, 55])

In [8]:
#axis 1 operates on the rows
var.sum(axis =1)

array([ 6, 22, 38, 54, 70])

In [9]:
import pandas as pd

In [10]:
##option command C
url = "/Users/mcs275/dat-class-repo/ClassMaterial/Unit1/data/master.csv"

In [11]:
pd.read_csv(url)

,id,visit_date,visitors,day_of_week,holiday,genre,area,latitude,longitude,reserve_visitors
0,air_ba937bf13d40fb24,2016-01-13,25,Wednesday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
1,air_ba937bf13d40fb24,2016-01-14,32,Thursday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
2,air_ba937bf13d40fb24,2016-01-15,29,Friday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
3,air_ba937bf13d40fb24,2016-01-16,22,Saturday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
4,air_ba937bf13d40fb24,2016-01-18,6,Monday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
...,...,...,...,...,...,...,...,...,...,...
252103,air_a17f0778617c76e2,2017-04-21,49,Friday,0,Italian/French,Hyōgo-ken Kōbe-shi Kumoidōri,34.695124,135.197852,6.0
252104,air_a17f0778617c76e2,2017-04-22,60,Saturday,0,Italian/French,Hyōgo-ken Kōbe-shi Kumoidōri,34.695124,135.197852,37.0
252105,air_a17f0778617c76e2,2017-03-26,69,Sunday,0,Italian/French,Hyōgo-ken Kōbe-shi Kumoidōri,34.695124,135.197852,35.0
252106,air_a17f0778617c76e2,2017-03-20,31,Monday,1,Italian/French,Hyōgo-ken Kōbe-shi Kumoidōri,34.695124,135.197852,3.0
252107,air_a17f0778617c76e2,2017-04-09,26,Sunday,0,Italian/French,Hyōgo-ken Kōbe-shi Kumoidōri,34.695124,135.197852,32.0

In [12]:
df = pd.read_csv(url)

In [13]:
df.columns

Index(['id', 'visit_date', 'visitors', 'day_of_week', 'holiday', 'genre',
       'area', 'latitude', 'longitude', 'reserve_visitors'],
      dtype='object')

In [14]:
df.head(10)

,id,visit_date,visitors,day_of_week,holiday,genre,area,latitude,longitude,reserve_visitors
0,air_ba937bf13d40fb24,2016-01-13,25,Wednesday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
1,air_ba937bf13d40fb24,2016-01-14,32,Thursday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
2,air_ba937bf13d40fb24,2016-01-15,29,Friday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
3,air_ba937bf13d40fb24,2016-01-16,22,Saturday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
4,air_ba937bf13d40fb24,2016-01-18,6,Monday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
5,air_ba937bf13d40fb24,2016-01-19,9,Tuesday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
6,air_ba937bf13d40fb24,2016-01-20,31,Wednesday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
7,air_ba937bf13d40fb24,2016-01-21,21,Thursday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
8,air_ba937bf13d40fb24,2016-01-22,18,Friday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
9,air_ba937bf13d40fb24,2016-01-23,26,Saturday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN

In [15]:
df.values

array([['air_ba937bf13d40fb24', '2016-01-13', 25, ..., 35.6580681,
        139.7515992, nan],
       ['air_ba937bf13d40fb24', '2016-01-14', 32, ..., 35.6580681,
        139.7515992, nan],
       ['air_ba937bf13d40fb24', '2016-01-15', 29, ..., 35.6580681,
        139.7515992, nan],
       ...,
       ['air_a17f0778617c76e2', '2017-03-26', 69, ..., 34.6951242,
        135.19785249999998, 35.0],
       ['air_a17f0778617c76e2', '2017-03-20', 31, ..., 34.6951242,
        135.19785249999998, 3.0],
       ['air_a17f0778617c76e2', '2017-04-09', 26, ..., 34.6951242,
        135.19785249999998, 32.0]], dtype=object)

In [17]:
df.median()

visitors             17.000000
holiday               0.000000
latitude             35.658068
longitude           139.670038
reserve_visitors     10.000000
dtype: float64

In [18]:
df.head(10).median()

visitors             23.500000
holiday               0.000000
latitude             35.658068
longitude           139.751599
reserve_visitors           NaN
dtype: float64

In [19]:
df.tail(100).median()

visitors             75.000000
holiday               0.000000
latitude             35.661777
longitude           139.704051
reserve_visitors      7.000000
dtype: float64

In [20]:
df['visitors']

0         25
1         32
2         29
3         22
4          6
          ..
252103    49
252104    60
252105    69
252106    31
252107    26
Name: visitors, Length: 252108, dtype: int64

In [21]:
##put labels into list and then look up the list
df[['visitors','holiday']]

        visitors  holiday
0             25        0
1             32        0
2             29        0
3             22        0
4              6        0
...          ...      ...
252103        49        0
252104        60        0
252105        69        0
252106        31        1
252107        26        0

[252108 rows x 2 columns]

In [24]:
df[['visitors','holiday']].sum()

visitors    5287653
holiday       12775
dtype: int64

In [27]:
##return first 10 row (look up by location)
##first 10 rows, first 5 columns
df.iloc[:10, :5]

                     id  visit_date  visitors day_of_week  holiday
0  air_ba937bf13d40fb24  2016-01-13        25   Wednesday        0
1  air_ba937bf13d40fb24  2016-01-14        32    Thursday        0
2  air_ba937bf13d40fb24  2016-01-15        29      Friday        0
3  air_ba937bf13d40fb24  2016-01-16        22    Saturday        0
4  air_ba937bf13d40fb24  2016-01-18         6      Monday        0
5  air_ba937bf13d40fb24  2016-01-19         9     Tuesday        0
6  air_ba937bf13d40fb24  2016-01-20        31   Wednesday        0
7  air_ba937bf13d40fb24  2016-01-21        21    Thursday        0
8  air_ba937bf13d40fb24  2016-01-22        18      Friday        0
9  air_ba937bf13d40fb24  2016-01-23        26    Saturday        0

In [28]:
##loc - look things up by their label
df.loc[:, ['visitors','holiday','latitude']]

        visitors  holiday   latitude
0             25        0  35.658068
1             32        0  35.658068
2             29        0  35.658068
3             22        0  35.658068
4              6        0  35.658068
...          ...      ...        ...
252103        49        0  34.695124
252104        60        0  34.695124
252105        69        0  34.695124
252106        31        1  34.695124
252107        26        0  34.695124

[252108 rows x 3 columns]

In [29]:
##dataframe is a bunch of series combined together
##transform series into dataframe by adding second set of brackets
df[['visitors']]

        visitors
0             25
1             32
2             29
3             22
4              6
...          ...
252103        49
252104        60
252105        69
252106        31
252107        26

[252108 rows x 1 columns]

In [30]:
df['visitors'].mean()

20.973761245180636

In [34]:
df[['visitors','holiday']].median()

visitors    17.0
holiday      0.0
dtype: float64

In [36]:
df['visitors'].head(5000).min()

1

In [38]:
df.iloc[:, -4:].mode()

                             area   latitude   longitude  reserve_visitors
0  Fukuoka-ken Fukuoka-shi Daimyō  33.589216  130.392813               2.0

In [42]:
df.iloc[:250, :3].mean()

visitors    24.912
dtype: float64

In [44]:
df.columns

Index(['id', 'visit_date', 'visitors', 'day_of_week', 'holiday', 'genre',
       'area', 'latitude', 'longitude', 'reserve_visitors'],
      dtype='object')

In [45]:
df.loc[:,['day_of_week']]

       day_of_week
0        Wednesday
1         Thursday
2           Friday
3         Saturday
4           Monday
...            ...
252103      Friday
252104    Saturday
252105      Sunday
252106      Monday
252107      Sunday

[252108 rows x 1 columns]

In [48]:
df.set_index('day_of_week').loc['Monday','visitors'].mean()

17.177009027207877

In [49]:
df.index

RangeIndex(start=0, stop=252108, step=1)

In [50]:
df.set_index('day_of_week').loc['Saturday','visitors'].mean()

26.31368753502114

In [51]:
df.set_index('day_of_week').loc['Sunday','visitors'].mean()

23.87336200860258

In [58]:
df[['day_of_week','visitors']].groupby('day_of_week').mean()

              visitors
day_of_week
Friday       23.072737
Monday       17.177009
Saturday     26.313688
Sunday       23.873362
Thursday     18.922702
Tuesday      17.672137
Wednesday    19.230121

In [59]:
df['holiday']

0         0
1         0
2         0
3         0
4         0
         ..
252103    0
252104    0
252105    0
252106    1
252107    0
Name: holiday, Length: 252108, dtype: int64

In [60]:
df.head()

,id,visit_date,visitors,day_of_week,holiday,genre,area,latitude,longitude,reserve_visitors
0,air_ba937bf13d40fb24,2016-01-13,25,Wednesday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
1,air_ba937bf13d40fb24,2016-01-14,32,Thursday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
2,air_ba937bf13d40fb24,2016-01-15,29,Friday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
3,air_ba937bf13d40fb24,2016-01-16,22,Saturday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
4,air_ba937bf13d40fb24,2016-01-18,6,Monday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN

In [69]:
## return all rows where this condition is truedf[df['holiday'] > 0]
df[df['holiday'] > 0]['visitors'].mean()

23.703326810176126

In [72]:
df[df['day_of_week'] == 'Monday']['visitors'].mean()

17.177009027207877

In [76]:
#every row where the two conditions are true 
df[(df['holiday']==1) & (df['day_of_week']=='Wednesday')]

,id,visit_date,visitors,day_of_week,holiday,genre,area,latitude,longitude,reserve_visitors
259,air_ba937bf13d40fb24,2016-11-23,8,Wednesday,1,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
679,air_25e9888d30b386df,2016-05-04,15,Wednesday,1,Izakaya,Tōkyō-to Shinagawa-ku Higashigotanda,35.626568,139.725858,NaN
1348,air_64d4491ad8cdb1c6,2016-11-23,7,Wednesday,1,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
1490,air_64d4491ad8cdb1c6,2016-05-04,12,Wednesday,1,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
1712,air_ee3a01f0c71a769f,2016-11-23,30,Wednesday,1,Cafe/Sweets,Shizuoka-ken Hamamatsu-shi Motoshirochō,34.710895,137.725940,NaN
...,...,...,...,...,...,...,...,...,...,...
250222,air_947eb2cae4f3e8f2,2016-11-23,22,Wednesday,1,Izakaya,Fukuoka-ken Fukuoka-shi Hakata Ekimae,33.591358,130.414878,NaN
250409,air_8d61f49aa0373492,2016-11-23,48,Wednesday,1,Okonomiyaki/Monja/Teppanyaki,Tōkyō-to Shibuya-ku Shibuya,35.661777,139.704051,NaN
250595,air_90ed0a2f24755533,2016-11-23,57,Wednesday,1,Izakaya,Tōkyō-to Bunkyō-ku Sendagi,35.726802,139.758138,NaN
250765,air_0164b9927d20bcc3,2016-11-23,3,Wednesday,1,Italian/French,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
251021,air_a257c9749d8d0ff6,2016-11-23,28,Wednesday,1,Izakaya,Hokkaidō Asahikawa-shi 6 Jōdōri,43.770635,142.364819,NaN

In [77]:
df['visitors'].between(10, 20)

0         False
1         False
2         False
3         False
4         False
          ...
252103    False
252104    False
252105    False
252106    False
252107    False
Name: visitors, Length: 252108, dtype: bool

In [78]:
df[df['holiday'] > 0]['visitors'].mean()

23.703326810176126

In [79]:
df[df['holiday'] == 0]['visitors'].mean()

20.828063827386945

          visitors
holiday
0        20.828064
1        23.703327

In [82]:
df.columns

Index(['id', 'visit_date', 'visitors', 'day_of_week', 'holiday', 'genre',
       'area', 'latitude', 'longitude', 'reserve_visitors'],
      dtype='object')

In [89]:
df[df['genre'] == 'Dining bar']['visitors'].max()

348

In [103]:
df[[df['genre']=='Dining bar']['day_of_week','visitors']].groupby('day_of_week').max()

<>:1: SyntaxWarning: list indices must be integers or slices, not tuple; perhaps you missed a comma?
<>:1: SyntaxWarning: list indices must be integers or slices, not tuple; perhaps you missed a comma?
<ipython-input-103-488abe8f1f35>:1: SyntaxWarning: list indices must be integers or slices, not tuple; perhaps you missed a comma?
  df[[df['genre']=='Dining bar']['day_of_week','visitors']].groupby('day_of_week').max()

TypeError: list indices must be integers or slices, not tuple

In [100]:
df[df['genre'] == 'Dining bar']

,id,visit_date,visitors,day_of_week,holiday,genre,area,latitude,longitude,reserve_visitors
0,air_ba937bf13d40fb24,2016-01-13,25,Wednesday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
1,air_ba937bf13d40fb24,2016-01-14,32,Thursday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
2,air_ba937bf13d40fb24,2016-01-15,29,Friday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
3,air_ba937bf13d40fb24,2016-01-16,22,Saturday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
4,air_ba937bf13d40fb24,2016-01-18,6,Monday,0,Dining bar,Tōkyō-to Minato-ku Shibakōen,35.658068,139.751599,NaN
...,...,...,...,...,...,...,...,...,...,...
249732,air_16c4cfddeb2cf69b,2017-01-04,9,Wednesday,0,Dining bar,Ōsaka-fu Ōsaka-shi Ōgimachi,34.705362,135.510025,10.0
249733,air_16c4cfddeb2cf69b,2017-01-09,13,Monday,1,Dining bar,Ōsaka-fu Ōsaka-shi Ōgimachi,34.705362,135.510025,14.0
249734,air_16c4cfddeb2cf69b,2017-02-26,19,Sunday,0,Dining bar,Ōsaka-fu Ōsaka-shi Ōgimachi,34.705362,135.510025,NaN
249735,air_16c4cfddeb2cf69b,2017-03-20,6,Monday,1,Dining bar,Ōsaka-fu Ōsaka-shi Ōgimachi,34.705362,135.510025,3.0
249736,air_16c4cfddeb2cf69b,2017-04-09,29,Sunday,0,Dining bar,Ōsaka-fu Ōsaka-shi Ōgimachi,34.705362,135.510025,32.0

In [105]:
df.loc[:,['day_of_week','visitors','genre']]

       day_of_week  visitors           genre
0        Wednesday        25      Dining bar
1         Thursday        32      Dining bar
2           Friday        29      Dining bar
3         Saturday        22      Dining bar
4           Monday         6      Dining bar
...            ...       ...             ...
252103      Friday        49  Italian/French
252104    Saturday        60  Italian/French
252105      Sunday        69  Italian/French
252106      Monday        31  Italian/French
252107      Sunday        26  Italian/French

[252108 rows x 3 columns]

In [107]:
df[(df['day_of_week'] == 'Saturday') | (df['day_of_week'] == 'Sunday')]['visitors'].mean()

25.256869738495084

In [119]:
df[df['day_of_week'].isin(['Saturday','Sunday'])]['visitors'].mean()

25.256869738495084

In [116]:
df.iloc[df[df['genre'] == 'Dining bar']['visitors'].idxmax()]

id                           air_c6aa2efba0ffc8eb
visit_date                             2017-01-23
visitors                                      348
day_of_week                                Monday
holiday                                         0
genre                                  Dining bar
area                Tōkyō-to Adachi-ku Chūōhonchō
latitude                                35.775664
longitude                              139.804479
reserve_visitors                             25.0
Name: 245791, dtype: object

In [117]:
df.iloc[df[df['holiday'] == 1]['visitors'].idxmax()]

id                                     air_df554c4527a1cfe6
visit_date                                       2016-12-30
visitors                                                205
day_of_week                                          Friday
holiday                                                   1
genre                                               Izakaya
area                Shizuoka-ken Hamamatsu-shi Motoshirochō
latitude                                          34.710895
longitude                                         137.72594
reserve_visitors                                       58.0
Name: 122871, dtype: object